tutorials/cases/prescribedUsCases/tetrisCompaction/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 2D square, 0.02 x 0.02 m in the x-y plane, one cell thick in z.
// The 20 x-slabs give each top inlet column its own patch. This lets the
// time-dependent coded boundary condition inject a 2D figure one column at a
// time while preserving the same 20 x 20 x 1 physical mesh.

convertToMeters 1;

vertices
(
    (0       0 0) (0       0.02 0) (0       0 0.001) (0       0.02 0.001)
    (0.001   0 0) (0.001   0.02 0) (0.001   0 0.001) (0.001   0.02 0.001)
    (0.002   0 0) (0.002   0.02 0) (0.002   0 0.001) (0.002   0.02 0.001)
    (0.003   0 0) (0.003   0.02 0) (0.003   0 0.001) (0.003   0.02 0.001)
    (0.004   0 0) (0.004   0.02 0) (0.004   0 0.001) (0.004   0.02 0.001)
    (0.005   0 0) (0.005   0.02 0) (0.005   0 0.001) (0.005   0.02 0.001)
    (0.006   0 0) (0.006   0.02 0) (0.006   0 0.001) (0.006   0.02 0.001)
    (0.007   0 0) (0.007   0.02 0) (0.007   0 0.001) (0.007   0.02 0.001)
    (0.008   0 0) (0.008   0.02 0) (0.008   0 0.001) (0.008   0.02 0.001)
    (0.009   0 0) (0.009   0.02 0) (0.009   0 0.001) (0.009   0.02 0.001)
    (0.010   0 0) (0.010   0.02 0) (0.010   0 0.001) (0.010   0.02 0.001)
    (0.011   0 0) (0.011   0.02 0) (0.011   0 0.001) (0.011   0.02 0.001)
    (0.012   0 0) (0.012   0.02 0) (0.012   0 0.001) (0.012   0.02 0.001)
    (0.013   0 0) (0.013   0.02 0) (0.013   0 0.001) (0.013   0.02 0.001)
    (0.014   0 0) (0.014   0.02 0) (0.014   0 0.001) (0.014   0.02 0.001)
    (0.015   0 0) (0.015   0.02 0) (0.015   0 0.001) (0.015   0.02 0.001)
    (0.016   0 0) (0.016   0.02 0) (0.016   0 0.001) (0.016   0.02 0.001)
    (0.017   0 0) (0.017   0.02 0) (0.017   0 0.001) (0.017   0.02 0.001)
    (0.018   0 0) (0.018   0.02 0) (0.018   0 0.001) (0.018   0.02 0.001)
    (0.019   0 0) (0.019   0.02 0) (0.019   0 0.001) (0.019   0.02 0.001)
    (0.020   0 0) (0.020   0.02 0) (0.020   0 0.001) (0.020   0.02 0.001)
);

blocks
(
    hex (0 4 5 1 2 6 7 3) (1 20 1) simpleGrading (1 1 1)
    hex (4 8 9 5 6 10 11 7) (1 20 1) simpleGrading (1 1 1)
    hex (8 12 13 9 10 14 15 11) (1 20 1) simpleGrading (1 1 1)
    hex (12 16 17 13 14 18 19 15) (1 20 1) simpleGrading (1 1 1)
    hex (16 20 21 17 18 22 23 19) (1 20 1) simpleGrading (1 1 1)
    hex (20 24 25 21 22 26 27 23) (1 20 1) simpleGrading (1 1 1)
    hex (24 28 29 25 26 30 31 27) (1 20 1) simpleGrading (1 1 1)
    hex (28 32 33 29 30 34 35 31) (1 20 1) simpleGrading (1 1 1)
    hex (32 36 37 33 34 38 39 35) (1 20 1) simpleGrading (1 1 1)
    hex (36 40 41 37 38 42 43 39) (1 20 1) simpleGrading (1 1 1)
    hex (40 44 45 41 42 46 47 43) (1 20 1) simpleGrading (1 1 1)
    hex (44 48 49 45 46 50 51 47) (1 20 1) simpleGrading (1 1 1)
    hex (48 52 53 49 50 54 55 51) (1 20 1) simpleGrading (1 1 1)
    hex (52 56 57 53 54 58 59 55) (1 20 1) simpleGrading (1 1 1)
    hex (56 60 61 57 58 62 63 59) (1 20 1) simpleGrading (1 1 1)
    hex (60 64 65 61 62 66 67 63) (1 20 1) simpleGrading (1 1 1)
    hex (64 68 69 65 66 70 71 67) (1 20 1) simpleGrading (1 1 1)
    hex (68 72 73 69 70 74 75 71) (1 20 1) simpleGrading (1 1 1)
    hex (72 76 77 73 74 78 79 75) (1 20 1) simpleGrading (1 1 1)
    hex (76 80 81 77 78 82 83 79) (1 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type wall;
        faces ( (0 1 3 2) );
    }
    right
    {
        type wall;
        faces ( (80 82 83 81) );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 2 6 4) (4 6 10 8) (8 10 14 12) (12 14 18 16)
            (16 18 22 20) (20 22 26 24) (24 26 30 28) (28 30 34 32)
            (32 34 38 36) (36 38 42 40) (40 42 46 44) (44 46 50 48)
            (48 50 54 52) (52 54 58 56) (56 58 62 60) (60 62 66 64)
            (64 66 70 68) (68 70 74 72) (72 74 78 76) (76 78 82 80)
        );
    }
    top0
    {
        type wall;
        faces ( (1 5 7 3) );
    }
    top1
    {
        type wall;
        faces ( (5 9 11 7) );
    }
    top2
    {
        type wall;
        faces ( (9 13 15 11) );
    }
    top3
    {
        type wall;
        faces ( (13 17 19 15) );
    }
    top4
    {
        type wall;
        faces ( (17 21 23 19) );
    }
    top5
    {
        type wall;
        faces ( (21 25 27 23) );
    }
    top6
    {
        type wall;
        faces ( (25 29 31 27) );
    }
    top7
    {
        type wall;
        faces ( (29 33 35 31) );
    }
    top8
    {
        type wall;
        faces ( (33 37 39 35) );
    }
    top9
    {
        type wall;
        faces ( (37 41 43 39) );
    }
    top10
    {
        type wall;
        faces ( (41 45 47 43) );
    }
    top11
    {
        type wall;
        faces ( (45 49 51 47) );
    }
    top12
    {
        type wall;
        faces ( (49 53 55 51) );
    }
    top13
    {
        type wall;
        faces ( (53 57 59 55) );
    }
    top14
    {
        type wall;
        faces ( (57 61 63 59) );
    }
    top15
    {
        type wall;
        faces ( (61 65 67 63) );
    }
    top16
    {
        type wall;
        faces ( (65 69 71 67) );
    }
    top17
    {
        type wall;
        faces ( (69 73 75 71) );
    }
    top18
    {
        type wall;
        faces ( (73 77 79 75) );
    }
    top19
    {
        type wall;
        faces ( (77 81 83 79) );
    }
    front
    {
        type empty;
        faces
        (
            (0 4 5 1) (4 8 9 5) (8 12 13 9) (12 16 17 13)
            (16 20 21 17) (20 24 25 21) (24 28 29 25) (28 32 33 29)
            (32 36 37 33) (36 40 41 37) (40 44 45 41) (44 48 49 45)
            (48 52 53 49) (52 56 57 53) (56 60 61 57) (60 64 65 61)
            (64 68 69 65) (68 72 73 69) (72 76 77 73) (76 80 81 77)
        );
    }
    back
    {
        type empty;
        faces
        (
            (2 3 7 6) (6 7 11 10) (10 11 15 14) (14 15 19 18)
            (18 19 23 22) (22 23 27 26) (26 27 31 30) (30 31 35 34)
            (34 35 39 38) (38 39 43 42) (42 43 47 46) (46 47 51 50)
            (50 51 55 54) (54 55 59 58) (58 59 63 62) (62 63 67 66)
            (66 67 71 70) (70 71 75 74) (74 75 79 78) (78 79 83 82)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
