tutorials/cases/prescribedUsCases/tetrisCompaction/constant/pyrolysisProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      pyrolysisProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Pyrolysis active so volPyrolysis::solveSpeciesMass() runs and transports the
// fresh solid from the top inlet by Us. With chemistry off the reaction source
// is zero, so the species equation is pure advection and accumulation.
active          true;

heterogeneousPyrolysisModel  volPyrolysis;

pyrolysisCoeffs
{
    subintegrateHeatTransfer true;
    bedCollapse      false;
    criticalPorosity 0.9999;
    replenish        false;

    // Falling columns land and stack, so cells fill from the bottom up until
    // the receiver cap stops them. 0.3 is loose enough that the cap binds well
    // before the gas equations run out of gas volume to divide by.
    minPorosity      0.3;
}

infoOutput      true;

// ************************************************************************* //
