tutorials/cases/prescribedUsCases/tetrisCompaction/constant/reactions
species
(
    N2
);

reactions
{
}
