tutorials/cases/prescribedUsCases/tetrisCompaction/0.orig/Us
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Prescribed solid velocity. setFields initializes the interior to downward
// motion; the top boundary supplies solid and the bottom wall stops it.
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(top[0-9]+)"
    {
        type            fixedValue;
        value           uniform (0 -0.01 0);
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    "(left|right)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    "(front|back)"
    {
        type            empty;
    }
}

// ************************************************************************* //
