tutorials/cases/prescribedUsCases/tetrisCompaction/0.orig/porosityF
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      porosityF;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// The initial domain is empty of solid. Tetris figures enter at the top boundary
// with zero void on occupied columns and compact against the bottom wall.
dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    "(top[0-9]+)"
    {
        type            codedFixedValue;
        value           uniform 1;
        name            tetrisTopPorosity;
        code
        #{
            const scalar t = this->db().time().value();
            const scalar cellTime = 0.1;
            const scalar piecePeriod = 0.02;
            const label nPiecesPerCycle = 28;
            const label nCycles = 20;
            const label sequence[28] =
            {
                0, 0, 0, 0, 0, 3, 4, 2, 0, 5, 6, 1, 3, 4,
                5, 0, 2, 6, 4, 1, 3, 5, 2, 0, 6, 4, 3, 1
            };
            const label offsets[28] =
            {
                0, 4, 8, 12, 16, 2, 16, 6, 9, 0, 13, 3, 7, 15,
                5, 12, 1, 10, 4, 17, 8, 0, 14, 6, 11, 3, 16, 7
            };
            const label heights[7] = {1, 2, 2, 2, 2, 2, 4};
            const label masks[7][4] =
            {
                {15, 0, 0, 0},  // I horizontal
                {3, 3, 0, 0},   // O
                {7, 2, 0, 0},   // T
                {3, 6, 0, 0},   // S
                {6, 3, 0, 0},   // Z
                {7, 1, 0, 0},   // J
                {1, 1, 1, 1}    // I vertical
            };
            scalarField values(this->patch().size(), 1.0);

            forAll(values, faceI)
            {
                const label column = min
                (
                    19,
                    max
                    (
                        0,
                        label
                        (
                            (this->patch().Cf()[faceI].x() + 0.5e-3)/1e-3
                        )
                    )
                );

                for (label cycleI = 0; cycleI < nCycles; ++cycleI)
                {
                    for (label pieceI = 0; pieceI < nPiecesPerCycle; ++pieceI)
                    {
                    const label absolutePieceI =
                        cycleI*nPiecesPerCycle + pieceI;
                    const label shape = sequence[pieceI];
                    const scalar tau = t - absolutePieceI*piecePeriod;
                    const label rowFromTop = label(tau/cellTime);

                    if (tau >= 0 && rowFromTop < heights[shape])
                    {
                        const label row = heights[shape] - 1 - rowFromTop;
                        const label localColumn =
                            column - offsets[pieceI] - (cycleI == 2 ? 2 : 0);

                        if
                        (
                            localColumn >= 0 && localColumn < 4
                         && (masks[shape][row] & (1 << localColumn))
                        )
                        {
                            values[faceI] = 0.0;
                            break;
                        }
                    }
                    }
                }
            }

            operator==(values);
        #};
    }
    "(left|right|bottom)"
    {
        type            zeroGradient;
    }
    "(front|back)"
    {
        type            empty;
    }
}

// ************************************************************************* //
